Revit 2027 API
LinkElementId(ElementId, ElementId) Constructor
 Creates a new LinkElementId representing an element in a linked document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkElementId(
	ElementId linkInstanceId,
	ElementId elementId
)
Public Sub New (
	linkInstanceId As ElementId,
	elementId As ElementId
)
public:
LinkElementId(
	ElementId^ linkInstanceId,
	ElementId^ elementId
)
new :
        linkInstanceId : ElementId *
        elementId : ElementId -> LinkElementId
Parameters
linkInstanceId ElementId
 The id of the linked model element in the host document.
elementId ElementId
 The id of the element in the linked model document.
See Also
Reference
LinkElementId Class
LinkElementId Overload
Autodesk.Revit.DB Namespace